bench/mysql.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 1437.32 qps: 41694.37 (r/w/o: 41694.37/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 1417.06 qps: 41091.00 (r/w/o: 41091.00/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 1393.40 qps: 40405.15 (r/w/o: 40405.15/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 1330.41 qps: 38587.19 (r/w/o: 38587.19/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 1303.40 qps: 37794.71 (r/w/o: 37794.71/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 1241.59 qps: 36009.83 (r/w/o: 36009.83/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 1241.17 qps: 35994.58 (r/w/o: 35994.58/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 1187.19 qps: 34431.85 (r/w/o: 34431.85/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 960.99 qps: 27861.36 (r/w/o: 27861.36/0.00/0.00) lat (ms,95%): 4.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 969.02 qps: 28107.66 (r/w/o: 28107.66/0.00/0.00) lat (ms,95%): 4.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 1148.42 qps: 33297.25 (r/w/o: 33297.25/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 1135.79 qps: 32938.79 (r/w/o: 32938.79/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 1056.77 qps: 30651.46 (r/w/o: 30651.46/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 1053.60 qps: 30544.64 (r/w/o: 30544.64/0.00/0.00) lat (ms,95%): 3.96 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 1099.84 qps: 31896.33 (r/w/o: 31896.33/0.00/0.00) lat (ms,95%): 3.62 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 1085.67 qps: 31494.26 (r/w/o: 31494.26/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 1156.11 qps: 33519.68 (r/w/o: 33519.68/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 1092.59 qps: 31684.65 (r/w/o: 31684.65/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 972.98 qps: 28226.71 (r/w/o: 28226.71/0.00/0.00) lat (ms,95%): 4.25 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 877.55 qps: 25446.01 (r/w/o: 25446.01/0.00/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 917.18 qps: 26592.15 (r/w/o: 26592.15/0.00/0.00) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 992.06 qps: 28772.08 (r/w/o: 28772.08/0.00/0.00) lat (ms,95%): 4.03 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 1152.99 qps: 33436.62 (r/w/o: 33436.62/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 1194.59 qps: 34638.80 (r/w/o: 34638.80/0.00/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 1133.00 qps: 32858.35 (r/w/o: 32858.35/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 1168.19 qps: 33879.76 (r/w/o: 33879.76/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 1110.57 qps: 32205.98 (r/w/o: 32205.98/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 1153.42 qps: 33457.75 (r/w/o: 33457.75/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 1093.61 qps: 31705.76 (r/w/o: 31705.76/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 1064.00 qps: 30854.60 (r/w/o: 30854.60/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 1068.48 qps: 30987.53 (r/w/o: 30987.53/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 1107.10 qps: 32106.37 (r/w/o: 32106.37/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 1136.47 qps: 32957.72 (r/w/o: 32957.72/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 1113.19 qps: 32286.21 (r/w/o: 32286.21/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 1093.21 qps: 31702.99 (r/w/o: 31702.99/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 1120.20 qps: 32487.29 (r/w/o: 32487.29/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 1044.23 qps: 30279.97 (r/w/o: 30279.97/0.00/0.00) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 1060.40 qps: 30755.20 (r/w/o: 30755.20/0.00/0.00) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 1154.40 qps: 33471.23 (r/w/o: 33471.23/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 1130.03 qps: 32773.81 (r/w/o: 32773.81/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 1119.17 qps: 32456.40 (r/w/o: 32456.40/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 1117.40 qps: 32405.74 (r/w/o: 32405.74/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 1120.42 qps: 32489.52 (r/w/o: 32489.52/0.00/0.00) lat (ms,95%): 3.49 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 1059.95 qps: 30736.86 (r/w/o: 30736.86/0.00/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 1088.81 qps: 31579.02 (r/w/o: 31579.02/0.00/0.00) lat (ms,95%): 3.68 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 1135.40 qps: 32925.71 (r/w/o: 32925.71/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 1136.64 qps: 32956.80 (r/w/o: 32956.80/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 1121.38 qps: 32526.73 (r/w/o: 32526.73/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 1155.60 qps: 33512.25 (r/w/o: 33512.25/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 1134.24 qps: 32893.80 (r/w/o: 32893.80/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 1161.17 qps: 33669.57 (r/w/o: 33669.57/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 1144.60 qps: 33191.54 (r/w/o: 33191.54/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 1132.99 qps: 32859.98 (r/w/o: 32859.98/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 1150.96 qps: 33382.36 (r/w/o: 33382.36/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 1112.63 qps: 32260.36 (r/w/o: 32260.36/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 1112.19 qps: 32251.65 (r/w/o: 32251.65/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 1151.21 qps: 33384.35 (r/w/o: 33384.35/0.00/0.00) lat (ms,95%): 3.36 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 1138.20 qps: 33015.99 (r/w/o: 33015.99/0.00/0.00) lat (ms,95%): 3.43 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 1125.82 qps: 32645.85 (r/w/o: 32645.85/0.00/0.00) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 1136.20 qps: 32945.88 (r/w/o: 32945.88/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            9820009
        write:                           0
        other:                           0
        total:                           9820009
    transactions:                        338621 (1128.72 per sec.)
    queries:                             9820009 (32732.86 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0032s
    total number of events:              338621

Latency (ms):
         min:                                    1.62
         avg:                                    2.66
         max:                                   41.54
         95th percentile:                        3.62
         sum:                               899569.91

Threads fairness:
    events (avg/stddev):           112873.6667/158.96
    execution time (avg/stddev):   299.8566/0.00